# Brewfile
# Install Homebrew packages and applications

# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# Shell
cask "iterm2"
brew "zsh"
brew 'zsh-completions'
cask "powershell"
brew "mas"

# Cloud Providers
brew "awscli"
brew "cloudflared"
brew "doctl"
cask "google-cloud-sdk"
cask "aws-vpn-client"


# System Tools
brew 'mackup'
brew "dbxcli"
cask "1password"
cask "1password-cli"
brew "speedtest_cli"
mas "Xnip", id: 1221250572
mas "Magnet", id: 441258766

# Dev
brew "ansible"
brew "ansible-lint"
brew "black"
brew "ca-certificates"
brew "gh"
brew "git"
brew "git-extras"
brew "glab"
brew "kube2pulumi"
brew "kubernetes-cli"
brew "molecule"
brew "pulumi"
brew "python"
brew "terraform"
brew "yamllint"
cask "orbstack"
cask "postman"


## Comms
cask 'slack'
cask 'telegram'
cask 'microsoft-outlook'
cask 'whatsapp'
cask 'zoom'

# Editors
cask 'visual-studio-code'
cask 'macdown'
brew 'vim'

# Browsers
cask 'firefox'
cask 'google-chrome'

# misc
cask "adobe-acrobat-reader"
cask "citrix-workspace"
cask "dropbox"
cask "grammarly"
cask "microsoft-remote-desktop"
cask "multipass"

# Fonts
cask "homebrew/cask-fonts/font-noto-mono-for-powerline"