1Password.op-vscode
akamud.vscode-theme-onedark
bierner.markdown-mermaid
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
dotenv.dotenv-vscode
etmoffat.pip-packages
GitHub.github-vscode-theme
github.vscode-github-actions
GitHub.vscode-pull-request-github
GitLab.gitlab-workflow
hashicorp.terraform
jameswain.gitlab-pipelines
keesschollaart.vscode-home-assistant
KevinRose.vsc-python-indent
mikestead.dotenv
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.autopep8
ms-python.black-formatter
ms-python.isort
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode.makefile-tools
ms-vscode.powershell
ms-vscode.remote-explorer
ms-vscode.remote-server
njpwerner.autodocstring
pulumi.pulumi-lsp-client
redhat.ansible
SirTori.indenticator
VisualStudioExptTeam.vscodeintellicode
wholroyd.jinja
WolfiesHorizon.python-auto-venv